html/p01-01-02-murata.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>演習問題と解答(01) - 乃村研Haskell勉強会2012</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="演習問題と解答(01) - 乃村研Haskell勉強会2012"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-04"/>
<meta name="author" content="村田 裕哉"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="pub/css/text.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">演習問題と解答(01) - 乃村研Haskell勉強会2012</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">演習問題と解答(01)</a>
<ul>
<li><a href="#sec-1-1">出題範囲</a></li>
<li><a href="#sec-1-2">問題</a>
<ul>
<li><a href="#sec-1-2-1">問題1</a></li>
<li><a href="#sec-1-2-2">問題2</a></li>
<li><a href="#sec-1-2-3">問題3</a></li>
</ul>
</li>
<li><a href="#sec-1-3">解答例</a>
<ul>
<li><a href="#sec-1-3-1">解答1</a></li>
<li><a href="#sec-1-3-2">解答2</a></li>
<li><a href="#sec-1-3-3">解答3</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">演習問題と解答(01)</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">出題範囲</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>01章 About this tutorial から
</li>
<li>02章 Texas ranges まで
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">問題</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">問題1</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>      「外税価格 <code>(Int)</code> 」と「消費税率 <code>(Int)</code> 」を引数に取り，「内税価格 <code>(Int)</code> 」を返す関数を作成せよ．
      ただし，小数点以下は切り捨てとする．
</p>
<p>      
      実行例:
</p>


<pre class="example">ghci&gt; includedTax 500 5
525
</pre>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">問題2</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>      「外税価格 <code>(Int)</code> 」と「西暦 <code>(Int)</code> 」を引数に取り，
      「西暦に対応した内税価格 <code>(Int)</code> 」を返す関数を表１をもとに作成せよ．
      ただし，小数点以下は切り捨てとする．
</p>
<p>      
      実行例:
</p>


<pre class="example">ghci&gt; includedTax 100 2014
108
</pre>


<p>
      表1 : 西暦と消費税率の対応
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">〜 1988年</td><td class="left">0％</td></tr>
<tr><td class="left">1989年 〜 1996年</td><td class="left">3％</td></tr>
<tr><td class="left">1997年 〜 2013年</td><td class="left">5％</td></tr>
<tr><td class="left">2014年</td><td class="left">8％</td></tr>
<tr><td class="left">2015年 〜</td><td class="left">10％</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">問題3</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>      「外税価格 <code>(Int)</code> のリスト」と「西暦 <code>(Int)</code> 」を取り，
      「外税価格の総和に対する，西暦に対応した内税価格 <code>(Int)</code> 」を返す関数を作成せよ．
      ただし，小数点以下は切り捨てとする．
</p>
<p>
      実行例:
</p>


<pre class="example">ghci&gt; cashRegister [100,300,1000] 2015
1540
</pre>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">解答例</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">解答1</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="example">includedTax :: Int -&gt; Int -&gt; Int
includedTax rate value = value + consumptionTax rate value

consumptionTax :: Int -&gt; Int -&gt; Int
consumptionTax rate value = value * rate `div` 100
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">解答2</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="example">includedTax :: Int -&gt; Int -&gt; Int
includedTax value year = value + consumptionTax value year

consumptionTax :: Int -&gt; Int -&gt; Int
consumptionTax value year = value * taxRate year `div` 100

taxRate :: Int -&gt; Int
taxRate year = if year &lt; 1989 then 0
               else if year &lt; 1997 then 3
               else if year &lt; 2014 then 5
               else if year == 2014 then 8
               else 10
</pre>

</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">解答3</h4>
<div class="outline-text-4" id="text-1-3-3">




<pre class="example">cashRegister :: [Int] -&gt; Int -&gt; Int
cashRegister valueList year = includedTax (sum valueList) year

includedTax :: Int -&gt; Int -&gt; Int
includedTax value year = value + consumptionTax value year

consumptionTax :: Int -&gt; Int -&gt; Int
consumptionTax value year = value * taxRate year `div` 100

taxRate :: Int -&gt; Int
taxRate year = if year &lt; 1989 then 0
               else if year &lt; 1997 then 3
               else if year &lt; 2014 then 5
               else if year == 2014 then 8
               else 10
</pre>


</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-04</p>
<p class="author">Author: 村田 裕哉</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>

</div>
</body>
</html>
